#### DeleteElements Members

---

|  |
| --- |
| DeleteElements Class   Methods   Properties   See Also |

The  DeleteElements  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Document, ElementId) | Creates an instance of the DeleteElements resolution. |
| Public method Static member | Create(Document, IList ElementId ) | Creates an instance of the DeleteElements resolution. |
| Public method Static member | Create(Document, ISet ElementId ) | Creates an instance of the DeleteElements resolution. |
| Public method | Dispose | (Inherited from  FailureResolution  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  FailureResolution  .) |

# See Also

DeleteElements Class

Autodesk.Revit.DB Namespace